tap "1password/tap"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
brew "csvkit"
brew "dive"
brew "fzf"
brew "gh"
brew "hadolint"
brew "hyperfine"
brew "jq"
brew "mas"
brew "nmap"
brew "node"
brew "pnpm"
brew "rclone"
brew "ripgrep"
brew "ripgrep-all"
brew "telnet"
brew "tlrc"
brew "tmux"
brew "tree"
brew "twine"
brew "wget"
cask "1password-cli"
cask "chromedriver"
cask "iterm2"
cask "ngrok"
cask "visual-studio-code"
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Turnip Timer", id: 1502924853
vscode "1yib.rust-bundle"
vscode "ahmadalli.vscode-nginx-conf"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dustypomerleau.rust-syntax"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "prateekmahendrakar.prettyxml"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
