tap "1password/tap"
tap "aws/tap"
tap "buo/cask-upgrade"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "localstack/tap"
tap "render-oss/render"
brew "aws-cdk"
brew "sqlite"
brew "awscli"
brew "bat"
brew "csvkit"
brew "dive"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "hadolint"
brew "hdf5@1.10", link: true
brew "hugo"
brew "hyperfine"
brew "jq"
brew "libpq"
brew "llvm"
brew "mas"
brew "neovim"
brew "nmap"
brew "nvm"
brew "pnpm"
brew "r"
brew "rclone"
brew "ripgrep"
brew "ripgrep-all"
brew "rustup"
brew "snakeviz"
brew "sqlfmt"
brew "telnet"
brew "tlrc"
brew "tmux"
brew "tree"
brew "twine"
brew "uv"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "hashicorp/tap/terraform"
brew "localstack/tap/localstack-cli"
brew "render-oss/render/render"
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-pro"
cask "alfred"
cask "chatgpt"
cask "chromedriver"
cask "cursor"
cask "dbeaver-community"
cask "docker-desktop"
cask "fantastical"
cask "firefox"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "iterm2"
cask "little-snitch"
cask "logi-options+"
cask "lunar"
cask "mactex"
cask "micro-snitch"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "ngrok"
cask "notion"
cask "orbstack"
cask "postman"
cask "rectangle"
cask "session-manager-plugin"
cask "shottr"
cask "signal"
cask "slack"
cask "spotify"
cask "thunderbird"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zap"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Turnip Timer", id: 1502924853
mas "Xcode", id: 497799835
vscode "1yib.rust-bundle"
vscode "ahmadalli.vscode-nginx-conf"
vscode "altimateai.vscode-altimate-mcp-server"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "docker.docker"
vscode "dustypomerleau.rust-syntax"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "innoverio.vscode-dbt-power-user"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "openai.chatgpt"
vscode "prateekmahendrakar.prettyxml"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
